// Задача №18. Напишите программу, которая по заданному номеру четверти,
//  показывает диапазон возможных координат точек в этой четверти (x и y).


Console.Write("Введите координату Х1: ");
int X1 = int.Parse(Console.ReadLine());

Console.Write("Введите координату Y1: ");
int Y1 = int.Parse(Console.ReadLine());

Console.Write("Введите координату Х2: ");
int X2 = int.Parse(Console.ReadLine());

Console.Write("Введите координату Y2: ");
int Y2 = int.Parse(Console.ReadLine());